Level Property
 Gets the level of the room.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public Level Level { get; }
  Visual Basic
Public ReadOnly Property Level As Level
	Get
  Visual C++
public:
property Level^ Level {
	Level^ get ();
}
 See Also
  SpatialElement Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →